# 15.Выведите элементы данного списка в обратном порядке, не изменяя сам
# список.(input: 1, 2, 3, 4, 5 output: 5, 4, 3, 2, 1)


list_ = [ 1, 2, 3, 4, 5 ]
list_.reverse()
print(list_)